# Documents Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..Documents Property
Application Class See Also
---
Returns a set of documents within Revit.
**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual DocumentSet Documents { get; }
```

Visual Basic
---
```text
Public Overridable ReadOnly Property Documents As DocumentSet
	Get
```

Visual C++
---
```text
public:
virtual property DocumentSet^ Documents {
	DocumentSet^ get ();
}
```

# Remarks
This property can be used for the user to find all the document inside Revit.
# See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace